#
# Прикрутить бота к задачам с предыдущего семинара: а это значит
# Создать калькулятор для работы с рациональными и комплексными числами, организовать меню, добавив в неё систему логирования
# меню должно выглядеть так: streamlit.io (пример)
# система логирования должна писать в файл, имя которого задается пользователем 910 440 90 82 эдуард
# в файле должны быть записаны все действия пользователя, включая ошибки
def main():
    print("Привет, я калькулятор!")
    print("Я умею работать с рациональными и комплексными числами")
    print("Вот что я умею:")
    print("1. Сложение")
    print("2. Вычитание")
    print("3. Умножение")
    print("4. Деление")
    print("5. Сравнение")
    print("6. Возведение в степень")
    print("7. Взятие корня")
    print("8. Взятие модуля")
    print("9. Взятие аргумента")
    print("10. Взятие мнимой части")
    print("11. Взятие действительной части")
    print("12. Вывод в виде комплексного числа")
    print("13. Вывод в виде рационального числа")
    print("14. Вывод в виде десятичной дроби")
    print("15. Вывод в виде обыкновенной дроби")
    print("16. Вывод в виде смешанной дроби")
    print("17. Вывод в виде строки")
    print("18. Вывод в виде списка")
    print("19. Вывод в виде кортежа")
    print("20. Вывод в виде словаря")
    print("21. Вывод в виде множества")
    print("22. Вывод в виде массива")
    print("23. Вывод в виде байтовой строки")
    print("24. Вывод в виде байтового массива")
    print("25. Вывод в виде байтового массива")
    print("26. Вывод в виде байтового массива")
    print("27. Вывод в виде байтового массива")
    print("28. Вывод в виде байтового массива")
    